#Напишите объявление указателя на функцию, возвращающую long и принимающую целое.

def input_two_numbers(x,y):
    print(int(x))
    print(int(y))
x = float(input("x: "))
y = float(input("y: "))
input_two_numbers(x,y)